SET datestyle='ISO, DMY';
INSERT INTO brigade VALUES (1, 'Голубев'), (2, 'Холодов'), (3, 'Бельчич'), (4, 'Бабаян') ON CONFLICT DO NOTHING;
INSERT INTO worktype VALUES (1, 'Капитальный'), (2, 'Профилактический'), (3, 'Плановый'), (4, 'Аварийный') ON CONFLICT DO NOTHING;
INSERT INTO equipment VALUES (1, 'Водозаборная колонка', 'вк0343', '06.10.2000'), (2, 'Насосная станция', 'нс436354', '06.10.2002'), (3, 'Водопроводные сети', 'вс23432', '06.10.1999') ON CONFLICT DO NOTHING;
INSERT INTO defectivelist VALUES(1, 2, 'потек', 1, 1, '07.10.2015', 10, '10.10.2015', '11.10.2015'), (2, 2, 'неисправный насос', 2, 2, '06.09.2015', 5, '15.10.2015', '16.10.2015'), (3, 3, 'авария', 4, 3, '15.11.2015', 1, '15.11.2015', '15.11.2015') ON CONFLICT DO NOTHING;
INSERT INTO defectivelist VALUES (5, 2, 'блабла', 2, 2, '06.09.2015', 5, NULL, NULL), (6, 3, 'блабла2', 4, 3, '15.11.2015', 1, NULL, NULL) ON CONFLICT DO NOTHING;
INSERT INTO meter VALUES (111, '10.10.2015', 154.50, '11.11.2015', 100.00), (222, '09.09.2015', 200.00, '10.10.2015', 100.00), (333, '08.08.2015', 180.99, '07.07.2015', 100.00) ON CONFLICT DO NOTHING;
INSERT INTO meter VALUES (126, '10.10.2015', 154.50, '11.11.2016', NULL), (2224, '09.09.2015', 200.00, '10.10.2015', NULL) ON CONFLICT DO NOTHING;
INSERT INTO account VALUES (1, 222, 'Мирошникова О.А', 'п.Весенний', '890685844'), (2, 111, 'Абобусов А.О', 'ул. Летняя, д. 45', '8888888'), (3, 333, 'Мамрыкин О.А', 'п.Осенний', '890788844'), (4, 126, 'Мамрыкин П.П', 'п.Осенний', '890799854'), (5, 2224, 'Голышников А.А', 'п.Весенний', '890777866') ON CONFLICT DO NOTHING;